12619 478578
131395 60520
259 13354121446
18310 4330197
263 2318962241
1160 309362938
2459 2477167
6760 2221866
8381 9646089
20215 1769751
5556 4522778
11125 15300060
299 205505810
19869 7072846
514 434183051
9677 9996193
8364 7001496
11052 1616286
40663 161280
332 559498043
2952 32157973
264 1322883620
18208 5310908
23633 2177848
276 421326737
260 3606078899
11322 3174603
274 564788064
60915 91768
271 674362962
1070 131051841
345 846382899
461 212755463
44974 7493965
1288 10823994
473 103143859
92092 223149
10498 3549959
20504 614621
262 1511144621
563 127862078
28176 9767091
288 1456940959
287 3220711699
46781 2325083
107444 363918
2440 23404313
31794 839838
261 8374615151
2426 73249452
10886 10010376
304 1759874463
19425 11772140
305 1510557264
15068 11416390
3127 39052761
6017 2681361
390 345317987
584 77370261
69088 720638
281 1183948246
3622 15527130
344 267204132
154819 451249
486 378175817
339 695230198
335 86262061
285 488882532
375 93744830
964 26597799
84929 579063
313 535203936
2009 32296397
24257 10028132
6808 3396740
98421 599235
2251 13819736
5974 14368341
347 552838592
64644 2495789
32671 2986187
3359 20384687
2476 72525346
28273 12943756
527 352749518
2857 46932890
10357 13202303
8646 3748085
161071 838966
99212 732424
265 527828148
914 46204214
7666 28039319
104032 1151856
1532 30817224
1627 58935020
5382 18591204
3354 57946433
115466 264551
286 194651985
22286 2333748
102096 319470
19303 9561648
5582 19087343
42558 4243548
37624 2560694
16860 12429071
2554 27894882
351 375761464
17542 4001828
6509 34165337
45815 3481513
95493 930885
533 609918057
112099 3060573
26216 4158545
10260 7130116
6898 15508734
17398 13141708
14712 13886237
702 249477515
966 11151535
393 36794047
22233 2104905
24691 18411610
2421 77237013
2595 3243543
10837 30592429
1607 88456454
12936 5470625
7079 17724929
293 217081191
18004 8457726
71763 295124
53622 737103
84122 1365514
58915 1161379
104777 1785550
1013 9358509
455 292471075
3162 31706946
4523 5710258
815 5965377
35404 400910
7617 1441370
16547 769982
1342 7594824
13208 1364446
17827 1053257
40737 700446
88204 303276
19866 276744
1852 3553236
20792 1460487
46345 271952
123975 175618
41872 660138
267 755998379
1494 78152076
2883 25511251
2101 98020069
14510 5718472
5767 32047838
16440 10132109
2387 78658069
9494 9852244
772 96293194
70269 3733909
18703 5714336
14633 6395522
631 230495587
19238 9104908
521 268204790
3609 47865405
5071 29237939
955 126680291
32821 7379577
5038 39925794
8473 14825402
11995 12592347
1204 9222463
3644 26299795
1904 87177119
20672 10878305
8552 18490827
4621 41407174
2451 33950126
19385 8198641
103544 1480052
52641 169029
198798 50153
75819 63995
29032 8119122
109397 96776
11553 975608
7286 2265714
35416 3828107
97406 720603
506 112317899
272 324398627
16289 20920566
30090 996548
9492 2083174
363 56219862
1421 25550819
7480 1389786
15421 5513857
1537 70369380
87857 445207
2149 41222856
95245 1318640
66846 1842475
27896 4809962
75568 3858783
5563 5522609
7403 15254347
31896 1080912
10371 7664498
7029 10183133
3026 48753248
738 167976966
2549 3417552
714 242760613
3368 5777761
999 27925364
29967 15835183
4711 9395193
47450 197503
96115 135464
9325 1128526
1662 33567141
5689 8989320
1388 89108866
1916 17891195
133146 639047
10385 10628491
4649 49371285
418 274003686
59638 2608457
776 240789346
23324 6459285
18390 15216684
76651 978236
11350 10772269
1 421285270
515 57365335
73910 220413
5171 10402682
4302 10691315
61952 1171698
278 60602182
6579 3948466
76950 1435128
209712 212832
3018 6040715
298 158506866
112560 1265556
100031 961036
216643 47070
297 156560887
1909 92196098
4165 52256993
742 32620943
45210 468100
52283 8185907
94944 141686
11912 7651608
91252 2857313
513 1721944
102308 694086
109753 52111
17364 19047018
184354 2387298
4662 7807765
14939 9818614
2848 11377463
38443 4981036
133622 264590
49755 5235243
32622 148242
440 30653788
96591 40680
68112 1216583
1401 8957484
35523 6110827
17244 3065936
32753 6098520
751 128177316
4635 15503097
10732 8303102
185551 83932
67264 2188456
6920 16953851
71769 5002689
10935 5758132
36420 7793052
3679 5816583
26090 539038
1624 50505950
2109 167486936
67676 7118712
4875 60986747
196098 1531611
10627 20601467
18731 7362418
28223 9891229
37006 7693165
87618 2999920
215633 1823233
16791 5177653
43843 752221
1300 77485619
101935 309048
270 430579614
14534 19409188
26155 4777185
58733 3905776
21202 10507838
898 118759838
8396 7793473
86710 2436614
33682 8167943
296 438316765
10151 7056345
15661 4432928
7721 775673
73172 31293
383 26705875
45554 651437
38329 5527255
19741 5871823
2225 56029702
21185 5394408
8711 24091304
5057 9978754
73198 2257906
785 144669509
717 39263892
32678 12841741
18906 4675355
1354 213442801
5636 17205245
214244 6765213
3171 39870646
12733 14215267
58968 1080284
201086 2608624
39011 704203
12264 15077921
2821 30268590
9469 14270845
14216 8004672
6117 39437578
10811 6989079
11480 4889921
16241 14073661
17672 17136888
3785 36503488
45345 1862474
540 937784295
48125 36670436
1061 146969054
68627 16107488
2152 6614149
184265 27128
3892 13096515
8213 58512521
439 159073172
47504 3749551
14130 10835717
10030 13800490
35189 5189409
277 711831051
17474 2875494
73394 1201236
9047 4701019
62398 3348726
63206 1838098
11395 12079646
8192 13856690
13959 17163485
38831 5904028
1350 103712286
20862 12821245
110560 1236980
27466 3767703
10641 21465815
4342 50254999
32945 3456047
318 106950944
111087 1389960
57512 2348354
63372 994053
1333 7921866
10070 40516947
639 378397894
14139 2300040
654 6178784
9452 12809757
44784 296495
93316 972531
43208 1160013
20045 394450
4944 37449098
51356 1503992
89555 3700577
1221 3034839
87799 1287458
320 80961490
228403 160931
33632 2796318
8986 3372140
403 77836116
18296 1005792
3658 28384120
38826 10772911
484 395886368
25817 6832317
5387 29962219
160942 478665
191148 679800
3475 3856043
28710 1129332
45908 2379837
73382 405700
609 346795489
10148 10672763
14553 6715733
12930 1824607
17892 19477172
3659 64874776
2220 96988517
18996 14977175
7301 21934165
24647 6447685
52863 6038316
857 39376494
87726 4559611
5302 6382984
1711 52423458
1542 151473521
29479 14021987
19195 9455089
1719 11901147
67352 2524719
62391 2673138
125198 472372
19149 11163877
7865 18340357
81171 2972789
20377 1962678
33644 9494099
731 16595186
211729 59467
9629 15636652
20285 4272077
51188 3440159
39232 4030663
25911 9904823
30612 2265404
38657 195983
6765 13358382
1371 122767800
3248 3168832
72786 49997
1821 28636381
15546 9891610
19254 5825422
24084 10171215
30456 10037276
35983 7361074
46261 7631053
82555 396690
23751 11791574
2250 48344286
32632 1474830
13065 1793955
21090 3118166
15146 1252360
29398 1937410
80275 10402234
24971 1917073
5258 28961810
11169 3535776
109969 3467012
167212 3196529
44663 3095624
29834 9421284
36356 1228043
12981 21831801
200162 613786
122661 156893
346 39649799
52171 4171567
19133 10017363
7468 9597443
77942 1973915
2161 22920274
21847 17234571
5759 20772634
34589 6460438
34273 1385143
491 130539212
44126 757253
21546 16232657
317 118647829
43762 8675437
3506 37139441
21825 6128191
787 165522925
22279 7925773
10893 23464143
1150 92887681
7156 32466884
16537 6155083
132176 2365781
64346 5142599
5411 31637422
8988 10336479
284 64793179
80142 1835639
11869 9791139
6962 19562216
15362 10910290
22815 7675730
275 310006409
69811 29464
6862 9647630
30797 2286305
28905 8630436
2606 46203315
8622 24952995
10832 7960856
129341 1413346
1306 66594189
96503 3937136
94142 2688091
66916 3702375
12382 9174235
4655 16217077
27264 15977968
27948 12377489
69930 1301595
30077 7580200
16394 7323249
2943 10804146
11879 22617771
49511 5039415
31929 15034185
10380 32085592
29354 17229777
10678 24249028
910 72546176
2956 70524720
12388 8224934
14037 16019126
39441 5852476
75647 1650246
30625 3234774
20022 3404638
4996 24009212
53431 3397023
10964 20245537
2983 16744648
103584 2090366
153920 6075780
8348 14709119
1207 39108677
6880 1990018
23581 1643151
11980 4804720
10747 1427945
26759 572460
127409 174441
22119 7697193
935 32079062
140398 478220
1565 10421861
46050 1123622
29660 4206208
1866 94126191
569 20217058
32040 2739527
52069 3164943
5330 38780779
5407 14293180
99674 2063945
136567 393483
2888 17057597
48535 397923
824 7657270
37333 1154773
36138 644264
59685 2241415
788 16555132
25049 4202771
46894 355432
229071 148813
582 59048953
483 127656010
26286 11176002
9807 6389259
4550 23941751
96382 2493167
4644 14340095
12978 3061561
352 50074556
225258 139409
326 58213486
44659 315993
79950 33342
711 4007900
4724 7274493
12550 2298418
3914 1528885
590 40205481
489 34815361
835 3366482
11195 73677
17871 746837
8258 2350439
63513 201381
69357 2817816
10235 731845
1427 17056566
1063 20199476
61442 1927958
74431 2248910
68865 316268
208811 340415
103448 1333520
99195 1884433
2364 42423528
8057 22081841
24901 12079368
38589 4195318
32567 982759
6245 13248750
8476 1644557
92366 2799181
123595 364913
11470 12721558
97199 1544447
15397 16460939
36194 5728982
82483 3055215
30337 4668398
25896 4327683
170086 1446725
45442 3603579
170129 601466
7035 22719797
316 111961632
69621 1400782
68839 1346456
450 32478729
1682 12772744
18058 850550
24115 1669535
22161 7912015
4963 24279315
87205 2133040
19620 6485066
139838 1276701
31543 7996143
71590 1020723
40574 1057183
92537 1414603
214313 371297
41616 4379539
20812 28705000
6768 30936823
2108 93681823
66337 6280022
14461 10201193
6119 1549195
987 6741184
9782 12313363
3829 6495459
814 4463714
3258 5997398
13791 1045172
21415 10719504
12403 2383521
18256 2326378
48527 1003563
18568 5836100
22660 9313270
119844 3247938
5401 17833340
3001 71020314
26088 5857705
188094 986583
3230 42328731
1425 127105648
236595 185925
3137 25680582
109596 4874929
65389 103034
72121 14088038
151190 952834
131666 1494779
82554 6575792
537 8456372
1161 26221315
3432 354214
8003 2056989
65834 1546757
674 25677816
29981 3663370
3660 9464353
7744 23284541
3126 13695931
348 83172187
3824 61300480
111291 3262319
54817 747755
127046 1373659
289 48720875
188019 98453
72371 74780
13336 9653165
12830 13646095
5516 19545632
342 101552969
1477 35916279
49979 1165268
30462 1056052
823 21271464
70674 516970
135573 924022
371 86732669
52632 10127476
24754 1694359
13766 1569815
97397 129561
166834 115589
204359 312663
81354 2093876
11055 6371187
79904 337897
92640 221041
27009 6070645
1472 22323107
1574 2553269
135129 392629
37649 1537612
501 11361189
38894 2421946
12937 13911401
27629 579991
2935 927408
176228 836564
560 5136457
4269 1390008
5775 6057040
10703 5145759
88627 10194021
22908 6660722
4403 35731494
15848 5648137
11400 6969287
83190 3968856
398 13934812
11243 16239155
4012 40187547
4517 2764129
37446 15871743
6135 3532302
438 74259291
5480 38565723
3031 58909834
604 12105691
106056 5575808
43617 7329263
11412 2439248
35546 6160225
67730 948683
4657 10291880
61324 5035525
15840 2865113
2725 16853902
115243 2323227
24247 16228761
14925 15149382
36260 7588990
72981 1190696
25297 16323661
2006 2003384
61851 1172460
6657 278693
148520 35511370
111344 2179616
2978 22744221
61748 4176447
65322 2555899
3392 62523122
269 210711367
84537 5168026
78498 2294150
29127 4120715
85336 2156403
3151 46039466
2157 1084555
35129 5355289
92790 2414278
13749 15853565
44720 3792338
99191 1983209
62132 6532582
76479 283055
71403 5100447
2885 25141725
45660 1834561
1299 14880265
47423 6028190
13992 7256870
24340 864615
2845 1213336
167135 1287580
107715 2258577
10382 2187214
17696 3987492
38819 2740587
42987 2122505
21078 4634968
80192 317649
8025 11569230
31480 2896907
156696 235234
77372 3788428
8668 68933402
73500 8303363
31028 14388239
92538 39176224
1430 41620038
2393 58430902
887 118668807
6568 16994846
13006 33817404
3153 55700306
43139 474865
5886 3119727
48908 424962
31745 5457680
40653 130826
71085 164926
49028 5615905
147024 385181
98450 2358080
3992 3512929
186608 473099
63854 867268
387 55008409
194814 8091182
309 247701642
15794 10407021
312 519654401
45267 3035488
9461 2607187
9981 2036875
349 351753229
27277 1327573
329 191855837
92917 4399064
155270 2665264
159991 133971
963 6549594
17841 1178446
119413 399173
222494 36239
1364 4232437
107523 83108
57425 327782
430 36033597
45832 377181
22955 805868
198843 185732
9467 1429829
475 33239770
799 11397257
31814 7016231
311 164322986
27222 246525
1156 140715327
125179 184666
283 39895494
441 38310248
13439 14016292
25040 912040
17647 910657
4196 17134122
754 45087523
10593 1237577
1395 2860234
1794 12851946
35271 5603301
6924 22372982
295 140888843
39509 14075552
50321 432992
13442 7529296
15662 2196244
3435 11531295
1448 14416380
25976 5382539
911 7970307
356 64167568
630 19003362
77615 690656
743 2299983
1073 5318067
570 23548354
617 18442601
127740 390701
644 17462717
107975 393336
27542 739892
628 15634985
136346 275786
449 50787997
86338 169831
3093 17581892
381 49195665
21373 4639813
3678 28185060
168356 14037854
115980 33140703
113211 3056749
17000 9780490
84472 3068406
54459 4823902
1920 20767911
7075 7247051
60919 5506346
19078 9022730
74678 1434391
7043 5402935
14833 23973252
32126 4320572
180507 2401543
541 28664238
72832 4976163
20364 24988223
42658 5880068
3430 122594056
5654 1770393
5920 4817577
6386 2887925
421 78120547
40723 2041131
71304 374612
5527 1877408
2750 2161355
19877 4510096
6776 1717794
853 72024035
42432 357893
96628 255343
52801 491719
41808 1037373
497 81382364
62795 142201
765 129222395
114432 70522
56187 274113
30866 1830832
76399 11614345
1029 12460022
124772 148888
82891 5852471
2709 41725331
87358 2418058
168919 300297
6896 2036567
12276 1608744
46281 5047775
217448 197751
41871 6480908
22139 8102246
8547 2392059
606 21350629
9430 759426
157587 721065
65143 1184734
142495 10363995
124820 405661
95359 576863
102820 3214120
74930 2318103
60278 6597616
98128 2075781
468 39669672
17898 20741938
32664 11189426
1314 3513242
4868 1607444
15312 619363
18308 294949
24599 8288569
21230 9058943
79476 996243
112327 818951
138861 2707361
61559 224583
154219 465112
539 8097006
5726 1898355
1769 3756926
13044 700211
723 33112020
419 36188842
1213 4532764
3549 2815647
1408 5765749
6041 7513870
3886 1496280
730 14032545
5467 835518
4743 7150452
333 79709607
5363 336094
10944 892157
52860 137943
10514 3083873
35741 197407
23931 812356
42985 1191166
684 3726644
16271 1023593
6976 758160
27140 2854784
191579 123498
89322 63954
18484 446170
146172 254700
2552 3903021
3915 1585838
46364 2938749
78513 774540
28131 940032
15048 1427000
774 13551630
849 10582603
14496 40258125
28028 803804
11606 122564856
1666 9529519
2126 6030842
27601 741431
39316 430922
39257 617261
1516 3106974
133921 95668
102568 427642
6410 15579195
2579 4637064
50744 714832
128183 2087332
1571 6251792
47013 69316
97082 3097819
24244 4473422
111525 2563273
171884 759729
168743 994975
67006 2519327
75566 75198
34587 2864223
41082 3613961
816 5608598
1623 2445463
18939 2274116
63446 6931119
122403 657823
59370 3011060
24225 6520512
76157 4736033
3788 6905176
362 13061018
266 234818559
98254 2388874
71098 3727487
145696 376561
54273 1919920
4755 11949580
37724 794238
23022 3616588
9544 4208365
6755 2221588
41752 3225454
5454 8851057
137175 1399925
49363 1017853
4800 2548356
66968 2206136
10585 6090974
63304 2054848
505 16270217
40788 18508149
1191 7944875
12115 19133394
2155 75030262
36208 3618691
203273 244347
29997 4049043
22048 4345936
7206 10212124
1834 8144759
207608 396482
9983 11084724
186421 77071
164521 2643187
459 20227871
174022 1413120
5439 2318771
27673 9342121
660 48363721
4879 5583451
75847 1737197
115806 1063836
12598 7199018
139533 761587
428 74779235
23377 11736949
1579 13939984
127181 624940
653 28848591
1343 17476703
101156 1936629
15344 18895553
1087 29725531
114742 239763
39837 2001931
82982 2955246
451 61830179
73067 2251550
4072 41707344
30556 452433
158586 585329
197660 117641
122370 831189
3822 6712859
818 10628733
1453 12489949
23736 3122168
27155 6595963
22749 3402332
328 143806752
28660 4538724
44960 6902369
17790 1393078
7619 3040541
18154 358633
12186 5252045
3362 18535304
5465 1677005
10841 5583641
190711 250531
100534 5441552
104776 1248136
13745 9366583
19113 5330952
13463 7316062
7393 19547765
58678 4255894
182267 163900
303 51409354
14467 18211470
14035 12067393
14007 18601923
14196 14524799
55985 1926668
59295 900235
11994 12851114
34056 7985207
177931 2712960
128905 2522855
52001 9706250
185278 259272
120084 2190227
15070 6706084
5902 11720841
415 41566324
183384 245455
1219 12858150
195478 74765
125448 210995
32607 2640820
1052 33165054
129691 77023
16921 11477849
122368 66482
1501 9314628
18259 1470848
20808 752179
19508 2616634
93300 935270
28049 1511532
25295 5510017
4256 27819089
35610 2269167
218570 166323
139604 680184
38818 1952662
77137 5135358
164002 140317
234026 79621
107982 260711
44526 1202804
1872 7165065
4896 5218535
2974 32998128
1097 104219404
926 27657919
39067 2136937
51770 4193774
2303 5557130
19943 1136268
6257 15100665
45361 6243077
21302 1338784
4983 2565841
40344 3597822
642 6554953
30239 1243587
2840 4319186
13932 2376180
211112 376469
94099 377276
7305 3938464
40524 5591078
6977 8427478
163228 342517
7534 5836017
130412 89938
1838 4845701
32884 4347263
72399 1284001
39858 6757614
1998 7771127
54743 2956294
3278 3613719
190384 78099
25490 5294603
93317 3992711
4050 3123065
157692 374172
10360 1778650
16223 5386962
6342 2838271
99389 81892
10902 4975117
6321 7516120
88138 1520364
76334 127335
1459 89267286
4178 2682683
131634 296870
26922 1607444
11329 5265212
3438 4173240
78357 3213185
66901 5500037
90965 290379
167001 180293
153558 295871
84149 527542
2169 2559554
19712 2146350
28287 69993
228433 18296
5370 17292862
8768 14367040
5392 3175650
27097 831607
81022 5766597
38328 2852321
4668 2225131
5016 2171061
11495 14900645
25904 2036313
150258 191568
42810 4768009
81315 472324
16342 12128007
13712 908781
64200 1158142
45171 4644440
1641 20754057
174938 317946
6665 21592369
16197 451207
23071 2380749
19461 4216721
4964 56778506
61098 418265
43199 6603591
23852 9519940
179707 62574
40557 5149704
5150 28647445
7314 18437122
11798 14942273
8848 11841963
34865 1440428
51245 1749497
76391 6900839
87470 2014466
40872 2094871
68081 1987531
1406 69540519
19298 7573776
31488 14869198
14049 12751916
13579 8933270
45436 7042467
17250 11195373
11212 8715288
2829 34466683
10954 15160852
5376 14786354
59471 6100945
58754 637883
40304 960070
41089 1009105
16611 10817115
12558 18238492
19540 16107463
1432 62846566
6274 16548965
13122 3413190
1397 19543346
238010 368151
20102 4510504
14866 12725299
7898 9989121
72532 3612218
3482 3653180
88483 2298166
47482 8608066
47906 7857798
6097 18488205
5700 16780877
37973 1140680
100373 853149
44603 812845
48034 831474
32663 1042674
20435 2906964
43439 4440894
41895 5460784
2602 14774511
4908 18089188
12156 5067583
87483 1500125
31683 7581199
63085 2891407
22481 892418
12628 3011762
2946 22444685
5471 7360710
115753 53672
4437 2486097
12020 17349730
202603 432355
40500 895650
34296 935645
64376 481511
4365 1278139
783 216997424
5112 11602086
386 4724913
170155 366765
16187 2367243
18036 1324878
11643 1750608
54924 646691
69222 366750
79269 1436392
48646 674156
10870 23457963
28807 5775312
30551 1397968
2620 36847901
16857 8047115
7814 8729402
9844 2924386
5621 29123679
115291 1808465
5284 3468297
20498 2707286
8387 8268357
47190 620549
12394 11492916
56461 2505980
95000 3608490
30344 7221903
59777 4307486
59633 969778
10701 6206274
592 6206275
40961 2751168
28901 5909279
37598 553737
42544 520481
26252 4140466
40465 479053
173934 2155113
103929 983942
15705 719319
14896 10108453
94620 547283
13392 4277010
1616 108112904
510 91488991
10378 10625366
173418 972816
129537 41866
126486 1579247
9142 5425364
1385 83808168
16932 7332404
101045 1619286
1059 79997431
5105 15119923
135782 194326
101945 142425
64849 805379
2486 66651298
13296 12816190
178939 2149433
15497 7561908
55454 462723
73779 1807642
25879 4419023
193605 25714
2672 16557202
75784 1759519
105067 2111260
2262 64990554
11152 4873744
2456 29684640
131148 2226619
39522 6939003
63156 5825461
59482 8416165
5425 9436557
67385 562923
102424 327343
3005 32524937
151151 149711
2302 46960172
31298 7667596
145081 2757136
6313 19530207
6844 20651444
14460 10933530
9228 4700231
51494 447500
45777 437352
13072 14604213
20778 7568286
28735 8588804
31125 1851903
134393 801602
166486 1680754
124972 1139788
178092 209043
1744 8480045
87891 5652320
14578 5439845
581 39218388
79129 2629424
7084 22205366
45224 2118430
48320 5392353
16322 14404474
786 25263704
39926 805980
6910 18464187
50887 9437708
39009 7964378
38071 7073945
9612 1518093
105649 1515477
4349 3277026
196901 217201
25263 3228870
2051 7472606
70618 62500
3548 558307
106381 156833
273 101963626
33021 40882
160382 214165
3770 400238
522 6519848
39314 41804
8316 81391
443 23050270
8294 2332125
3175 8246708
2114 30335557
6597 4084198
5398 204919
14431 430113
2148 2765700
35104 223494
1638 153933290
44623 2416224
27517 543404
74862 85305
476 33079673
2817 566209
3934 12679601
20860 112042
478 52055455
44811 15438
9133 1575279
112365 267492
4519 501817
7599 1393357
3065 2278986
54548 614515
72010 2818100
184223 2529837
98242 989748
62448 2332582
55241 5626812
35656 4601706
26568 2015544
370 14883532
29579 2208558
28250 2175737
80510 599835
42511 1174137
40798 8939841
454 10831844
608 2490411
6231 2281182
1320 1442096
2740 8155287
1829 33696014
3840 2997615
10910 1566195
4133 8592061
566 83773005
7285 2039763
57900 48348
36248 38232
123642 71600
7227 229890
70050 5141283
2404 48988339
192917 1393968
268 156103999
200884 1762951
132363 3030898
24311 122443
746 7269628
105280 1595353
119293 4061756
15063 4411756
29463 1614824
94209 2819911
8339 7050225
452 105295023
188571 112188
40431 3617534
4539 5590404
4407 5998977
124195 362931
1341 9848258
215647 827234
340 17450632
9969 122142
27245 200174
31593 7715818
186995 3033688
130721 474923
5650 1876817
205038 123667
76240 2788577
82922 348862
753 4151286
96761 731229
95383 2337945
2110 31140937
2130 9982780
31574 7785322
74298 8894817
44696 7331188
2584 16720519
15454 16008701
1503 3057175
5260 1756848
11232 17556368
58532 5254373
25897 2546249
12577 4620968
41452 2191441
105984 2585626
498 8404735
54862 3708913
115107 90955
150143 399802
74047 739147
192623 692835
15388 17614586
85316 3413176
72983 3441678
424 116433950
3051 6095239
46475 7672028
11469 10871530
8889 9974059
142331 1268887
547 50149412
27247 4971802
14913 2895951
12245 1944849
56725 4780633
16760 6666779
40154 10373796
123689 211446
458 33546985
116307 831254
155190 113115
1351 7100606
84338 2474297
12393 3774918
27930 9236101
12624 3535983
54676 5991106
4610 6735815
104899 1163202
59953 2828410
60912 5160528
38861 9045959
10909 2641454
9564 2341320
8896 9889433
21107 11468523
24835 4628638
119015 1535639
38620 4902259
87249 5727387
1837 9779073
11964 1788516
30879 5163667
10912 1154507
9091 2617215
9340 14905631
3315 14412724
88151 3524331
8314 9628064
2953 16078269
4234 513133
9401 10430988
16533 15243649
520 9204711
3406 2624176
90865 3838774
121132 252902
18927 4673168
3726 4338845
30270 13075045
24083 14321369
28746 12048644
29426 7994224
22345 16982291
14577 1639666
1229 8290111
3130 2310951
8106 28280933
24004 5279141
55729 2098720
21118 1676772
35897 7670256
7069 8006892
120772 78308
38614 1047045
1370 20380038
2485 14192973
2469 70933694
447 40776601
148139 897704
21617 16710250
8126 9044453
416 79648366
13757 10406156
1279 274649460
291 383074541
382 28390434
117846 1369982
17231 6994511
8325 18285954
102731 2657793
26555 9236858
16732 9818226
336 393583032
74187 1598178
1037 96126270
35670 1037065
1689 62593250
9192 16295718
14503 16092163
7680 16547246
118386 1022554
18869 3413874
41412 1076120
12127 4838289
32990 1118381
8634 3584510
45073 855831
7414 804133
210635 297860
20954 10052830
2841 40562664
11310 22145977
31846 2200405
10840 1750667
41525 6454184
2367 6823249
9463 9464610
14701 18925491
28205 598393
8311 5879100
92600 6014088
14201 10977338
3454 11847655
102753 1201812
33029 2899830
1525 22931586
28422 10636735
3527 40666138
33778 7000740
94043 2707128
68392 3237043
157280 793174
6798 5098113
52495 9881662
17145 21178277
48037 2684301
11872 6504819
129169 2186327
103204 524827
33732 982621
68454 272122
49636 2102216
31499 3809128
221254 229760
207594 663874
8142 10771606
163221 230108
50697 2882276
3007 37863652
6127 15905495
15544 6218925
36938 4543024
12693 5362200
6559 5684078
19934 3487088
155816 1120508
59958 2591369
18521 3809573
128944 213046
97886 258086
99662 280200
7483 8644706
12636 6359368
13159 6008417
34784 1922354
36478 5125457
13283 18035551
1002 35339107
23007 6366099
114176 1050433
862 6763152
75259 2788356
2559 49318232
1578 29081929
12360 14047850
106032 3938835
431 43330339
205480 140220
54055 226241
8593 14838293
55753 386908
12632 485753
47952 1743364
49968 2880306
2354 42774561
5673 36783614
17312 18742647
9825 27619993
7303 5590136
19935 920708
224701 27040
125356 137112
10291 2206052
366 61777634
79362 33920
2208 4171965
145048 459628
5945 25649043
4836 23257586
57505 93337
6611 830468
85698 164913
43880 501993
39391 571082
8484 5009612
15730 3588695
16216 564619
5317 8444165
45389 1872054
15757 10763120
30061 5273763
36002 4184322
17230 2643394
4645 38079160
12000 1764745
1847 891608
4906 18062177
6271 3663969
9194 2548821
24929 8522228
138008 1224267
16629 6607344
6535 27760389
6269 4652177
53042 3546393
1469 88234839
79177 151662
9237 1927831
19625 1004917
385 53897820
3766 4650647
177384 43148
3294 5789886
21220 8492983
5810 26283045
2997 2100579
36529 5875137
21548 4268530
5835 12008925
45988 1889494
31852 610005
14181 8309761
71334 108281
399 113133595
15259 12979691
31560 5931915
57431 751505
112482 1227345
22500 6031856
101361 1598575
5976 13474467
27671 5619296
188923 657225
22491 6102592
32804 4534991
39260 3050208
8202 2067302
47828 2624473
23410 1023014
185061 738042
8778 8067208
39464 2583251
14447 11163608
44160 597347
85235 2054187
6329 23103447
4205 13354025
25997 5085675
36159 184350
145409 497422
42944 1508550
121593 1501122
54803 1692412
4245 12249126
53804 701452
125930 493343
43330 605027
7569 14615615
142776 695058
2784 15748818
3120 1528868
2945 12313206
44831 1478928
73587 3104453
13613 6920280
10685 16062747
15637 6063663
199985 1267372
2015 23949509
91036 2507181
13033 948239
125108 655157
9158 14344981
5255 7975601
98851 417451
17183 8335700
176453 407812
10677 598052
24836 643477
40904 1254501
17154 1534516
23223 5254342
75933 1401066
330 72398161
103925 2745152
5782 7618614
7186 9285028
1803 11532086
2477 37072861
37884 9562545
9387 31232588
80954 1250295
134950 45126
4054 30349310
8938 5996959
3706 10384842
35701 2863510
23513 4763513
51076 778649
1517 3811197
63016 561371
434 21183545
36190 2708445
71708 341752
13110 603817
31418 2925159
13300 291267
63028 437305
126431 1921524
2563 3445471
365 180699520
46908 3143390
359 135873384
48604 2270440
9374 5822515
28158 6747037
24337 2948685
2664 748590
6865 4559257
104379 400786
26123 196919
102611 334934
3968 854496
125173 180187
28048 513101
48358 1273098
4304 801698
5837 2168239
89966 179182
99699 335428
73869 973000
2892 3242825
2968 3774062
29735 320041
503 12973433
900 8333364
2119 72968748
6975 41851234
3373 18657604
331 49875372
163037 229512
3361 47589345
226450 748135
16994 2286333
64210 6055462
85223 69751
12067 172666
14572 1416696
11962 5462759
5169 17533842
31630 2363796
2718 36821654
15161 2329855
9048 11122732
10266 4780996
61505 4078607
51487 124714
72437 2316367
21181 971471
13523 10457350
198965 171517
104333 1761851
2847 39530111
45626 6914928
861 26561689
22243 8771250
83458 3568865
122004 99431
38875 187066
45785 387298
31320 4313849
61158 2770278
4837 38149812
25609 1424394
12782 2291800
17752 8190282
46313 1715031
2629 3291743
19918 1248033
9502 15744213
63722 2184244
42075 1435699
3736 2021505
32506 2830460
15129 15339858
14355 8959740
9966 989095
205168 1309653
20444 4304173
51884 7381429
20124 7960628
325 120369684
20025 2693501
171707 444416
63847 206423
78704 521280
134319 439456
2599 2803840
2222 280418
45150 274608
159643 3244267
207656 3131375
46171 1589608
7650 1940198
52900 289458
123448 1054306
2351 11356513
100993 242199
48946 1377595
153362 1374648
97951 2419644
54886 2979925
130121 432719
519 7203330
314 85479013
74585 8209432
1596 5166586
134573 992383
39874 344496
111009 964156
20535 828715
128245 812582
7119 8578807
18205 12042337
122302 303753
8016 3766432
919 3160055
15508 10933760
10219 12140468
14971 9022538
144182 1734900
58926 5070277
23149 786318
122788 910427
30876 572792
15427 13316851
19497 15461884
899 4560420
6906 37524407
36031 4694023
115188 239684
140345 45422
81418 7897071
87239 451518
87210 646635
77875 4791432
86101 3842827
63817 5023704
73836 1734927
65901 8390432
33891 5624508
30600 1412290
31122 6648243
41980 15929447
4334 22300239
4685 19613432
6298 794487
13506 258184
67205 1091896
16279 9527900
165413 1602080
54054 422759
36308 760721
104683 254294
4040 10024034
191638 320939
15357 1370826
10812 339492
2162 2300670
115166 519371
60525 1018303
282 190460241
290 801856537
2529 1123328
481 40040558
52592 188112
24806 5064344
77722 80683
19002 6344247
113863 793949
18383 9098989
59067 54692
11248 3550444
323 2586022
33120 1373709
134736 157976
12432 1072346
1045 5165052
391 31592617
613 11808758
12340 533864
511 53465501
113584 303592
31463 537838
16874 711865
29826 3320248
37284 2312180
21819 2603106
43277 984947
24734 1371735
134115 76857
133404 279446
4448 5278590
110880 161682
62103 2309427
10295 15330976
42088 463390
4677 1716243
118259 79297
12688 15166225
99456 2555790
1669 59365337
11592 10853688
20276 8913636
3738 21769232
638 29577803
29368 5287690
4940 22033463
1025 15559032
40250 2670617
25645 8841839
1546 63819281
27067 4413030
40598 843657
197285 275121
137941 1204007
22126 546170
17478 1699250
108239 1491664
3826 8570127
18072 12351131
71018 3786408
87473 1497776
21981 4651096
8224 9414702
8658 15581226
11613 370163
17296 3950119
43437 4419203
105452 653709
10758 1760673
25973 4073438
19466 2128354
88443 1336392
3009 3559002
54921 957919
8449 13380983
3398 11752828
2058 2020911
15924 3930244
15965 19341473
28836 5605006
6101 2326879
16432 2785475
25505 11148058
109908 3559256
62096 4210905
12521 5528718
47446 4844320
83611 332435
56636 1408216
156934 835239
73463 3111325
3684 7685863
61677 1907010
21607 2740452
1143 29037600
30927 3709555
15737 8944735
12529 3808047
6754 5439266
54989 248078
46204 353214
31094 6522752
25720 4155167
72751 5152217
42464 4942512
125486 217781
76368 207171
5894 3427899
158383 95584
6320 25238794
67189 138300
195956 7098
5037 2120871
1455 10702112
229421 26621
15941 5460438
42685 5610302
9345 5876416
697 14276012
29128 3195218
12909 15912667
70947 1611755
110533 811705
12747 7980758
6849 29623984
78788 250806
69452 3357814
41632 3698491
14821 14923156
102539 1648137
37934 526061
190982 303828
33716 2484911
37281 788812
38978 5680622
95255 651011
20233 5503253
35591 321241
197270 721645
110679 675969
64489 6640694
1717 2730285
1963 18892388
33846 2532263
82750 1823499
444 42608703
60937 1403627
81311 1419845
9155 5750101
39989 1027213
21650 991351
126909 479210
58537 5609442
6518 164179
5174 528798
113644 881173
40249 8544436
70590 4001480
68096 3366529
83379 1955325
2463 1330647
1088 6819143
233911 656386
151862 1944391
48501 1967023
2442 9516576
53276 1944320
81674 236324
6362 1014644
101158 295619
93594 1041571
70876 492501
490 60169197
93113 201248
66147 5165183
17706 14365397
112811 2621769
20827 9660877
93019 4928740
3416 15319507
140956 487486
2478 24610497
18288 2426490
56408 5779289
35094 4589678
130050 7108756
414 59949347
15219 20665322
8619 947635
33963 2571573
103532 187494
10891 11877995
1181 9917848
120362 7411245
175175 306673
28501 4683937
62505 6818460
23286 14281796
143960 146980
7670 24924908
28021 11341262
61204 8200012
48104 5296027
186429 699695
48475 5737388
70214 549540
3868 5309215
81305 9329636
3782 1783436
69618 1138042
174448 2767673
7969 1651167
86522 2103675
85012 1100997
129609 1268533
8398 404762
91427 1556979
66948 447301
4570 3298301
4194 1758485
408 20139572
564 34121164
6331 1051434
380 59017913
6453 4646204
62126 1592982
5683 24517174
49555 2901385
86913 1179910
17687 9840147
6397 25855312
38731 502489
4501 1730889
57676 2744322
32590 4817549
358 26043074
77293 3214935
109410 2272300
22905 8366159
70874 799117
36747 862775
93119 74363
280 133985473
185544 1226224
334 69029211
2358 12839310
7122 1378194
4305 3548359
27010 958903
5564 1863378
2726 1649247
41949 408854
64324 251712
90791 238388
85998 864431
159457 97324
744 126738807
2427 6809800
205731 23863
138858 748658
109625 246305
42839 591372
209196 1445017
101947 2351153
81034 3984201
64170 304517
143810 753907
8699 2825345
12844 789649
621 41331266
184418 5012597
79802 919474
1439 15077106
3322 14211007
38847 737014
144894 988945
32806 23889619
7410 1109210
10735 2131909
379 58893338
37627 5253062
3600 7688994
57497 4995056
17002 280523
149224 233886
1380 8105010
116671 776277
4780 1924655
83949 2429236
2594 11194514
58324 7372974
148020 256828
140911 553525
48580 1372270
25513 440738
79936 3095495
6083 1411787
7006 2250045
153935 1660802
13270 12349553
138771 304900
30944 3649508
10290 5519778
11467 17768272
57065 1214204
25141 4334503
25444 12403652
159713 931796
85109 2095721
73110 2692357
4397 15857620
7674 13985189
207050 145738
26521 2827402
167742 2066443
21087 1507663
39158 1412707
4515 1775707
1036 11879289
82903 240427
24735 907827
103513 273847
143727 225192
144166 1037777
200499 41792
357 105880854
112641 468414
593 4162564
150172 1615759
212375 6194
104583 199872
21918 556937
215494 88374
80684 3565011
15533 2554803
94285 3833989
31544 8116477
10945 7171155
307 44342964
115799 10172
148284 7569
54995 18131
11536 2463604
6367 6048645
36033 2370100
664 26409837
866 16939614
62525 464226
2362 651939
155606 110654
18386 775670
23146 838857
16352 5048309
5909 1569316
19648 883584
7376 3148940
52202 183953
3950 6969189
121293 2413
372 23637187
164662 101082
11656 1177556
11043 496659
10331 8530073
70793 741529
194145 134866
48325 693834
37583 3088730
12490 1024087
99476 39399
42823 379672
549 83572262
2206 7605985
1680 5294273
9548 5732718
546 59288419
2964 9591043
96787 326591
525 38199856
6371 5979064
113773 58216
53076 344513
194989 103279
80397 26173
200662 35434
46560 975394
132294 356588
188953 852139
16106 2211644
4257 6583221
2681 7364515
234435 7206
172957 172082
57080 408295
66179 307022
175165 101651
197441 389885
62494 2082499
8087 344788
130451 19441
1250 38332004
147675 9517
29576 1136678
95022 43895
9485 104906
14823 753810
4699 10739174
76502 3004792
27687 7840670
86755 1087109
6338 22750296
14717 9486290
56449 1376537
22285 8485879
22890 7716464
123466 2269313
59549 242848
41450 5289635
25236 6967683
129480 153987
3043 21325673
22022 6557522
159970 1719638
6396 6280883
33009 4774736
8262 1321647
106543 884998
3091 17395482
26031 7794842
74504 2542712
11463 4835869
70738 4849302
26866 8486118
28298 1226467
27696 6165611
5897 37045305
109915 992332
70884 4322556
211401 12996
60025 139274
54905 178855
200980 19706
15444 243691
10085 4802103
8568 1511064
30286 4081043
51177 10757798
7038 1230698
85175 1288311
19378 9292807
68974 905288
50303 4516436
18344 4050358
175276 1594367
9935 18522389
5686 1179463
69543 721292
155239 1397109
62351 2031503
94260 2278251
151934 190189
16042 4214755
46337 5134839
155157 7084626
61996 480373
60721 1934907
894 183384941
105650 26280609
12483 6360369
22923 5632013
16461 4439455
32722 14705881
58250 7038527
204921 898005
55538 1094885
33533 4705474
14251 6481400
74910 2023889
51366 2194608
112790 4070887
151216 1389895
19966 9938638
21254 7853206
62068 2701302
10833 14646621
164540 44984
40983 6663864
124549 1999059
22944 2804886
154873 986756
845 4793646
14628 377660
143541 1937557
38281 6230728
150668 565394
53323 540509
168255 21106
92172 407456
96354 3316544
294 9876669
22938 1753158
2165 2782802
10890 9806398
46070 1072887
7984 17412585
20935 9985668
9262 12890948
2736 15552429
12415 2585719
8545 23054505
205818 107156
18822 807851
1259 955901
8368 2926554
16386 2994526
32944 4153491
89331 105114
50118 2713081
110391 2335186
123673 931901
2694 2111126
10204 2220995
17303 1057637
28397 343254
5275 6845838
16301 6520935
41070 7471669
126894 1884159
5942 8341992
14957 5018709
13181 1976394
40994 529397
20492 4304622
177334 543046
3534 27635126
9853 1586045
2530 3766557
43345 576517
3024 8496273
35885 6052382
228850 3609748
27435 4482081
23749 3329887
73181 1784874
16443 1857727
170511 217059
531 36760200
55016 3181606
6500 3023902
40833 2158822
27613 6078173
42489 1048181
9180 870637
74126 4030181
8407 6631495
12048 15036381
122430 88000
53788 3344066
1928 4311282
6280 2156695
112357 2286419
58758 6491614
134425 918278
22334 11028431
21511 5503350
736 8610325
21104 2019998
164505 3260679
29747 7890592
38022 6073846
40422 1763519
108901 1872748
102270 2638847
177362 107582
17458 5072169
52764 3721484
125555 2331705
82092 1713187
39261 7306596
79767 2730490
9877 24063516
20671 11954908
61507 6326929
48864 2708552
123364 2284583
8875 8573765
102154 1736719
134226 2034595
49206 5081651
16884 3802547
4842 16016333
21115 3886187
56652 6469818
77684 441024
39609 8075812
15977 1009746
11414 1238263
1435 2552835
704 1799716
8745 1399792
2150 3038431
938 3059634
579 8796414
11988 2536097
9856 1211900
9171 20401536
25421 10613698
11301 5777833
115917 804827
29494 27678196
65833 16936647
3357 19556266
9297 2619510
1290 17379529
95431 182298
16703 1820402
538 51116366
46665 6136572
136054 4019099
4087 12109721
5397 315528
14011 236087
9910 2214141
48180 1950912
27600 665134
234969 113106
70938 1407887
30273 803947
13027 2237878
32532 7458146
44505 3187830
8382 2602943
173406 1120108
719 4240990
104793 232246
25536 896815
20150 4580802
88876 1944061
101710 1665177
37363 435222
110165 281067
105920 2487934
5246 3641665
19792 868827
1648 2513579
10859 1538798
6831 1267411
14047 4932712
71009 4426016
44131 977893
2835 39675265
165258 733501
177986 740589
79376 485240
122840 461208
32974 11288630
39076 5388833
11076 15400154
18775 12347213
44336 1664368
95278 268897
3004 46036392
3993 20243590
13987 15308444
35686 2272925
43920 1433530
72869 1832937
122869 1093261
88664 919849
6460 2952721
45491 3442484
3385 29907578
12004 8546684
6715 29151915
1102 40632549
28688 530781
34606 7849801
30421 4920177
8519 10014787
172211 170250
96890 786859
14744 10612970
177110 4722084
5123 36158508
41785 4186760
54628 11776416
60084 968415
27906 7181741
43140 2479656
36753 3844927
33794 5830156
1332 7259549
43849 1603468
17271 10900410
781 50300539
136601 1518196
99557 897005
38876 7561867
92669 3211773
167123 1054381
70577 3275819
16017 5417505
12546 11499238
67171 9349080
8815 313163
596 231712360
1392 15515533
8856 17411276
131003 2116011
123583 1293900
1540 2678288
61209 873736
10517 7855311
53152 17539573
691 15919800
45702 3756415
364 52313534
50509 3351660
50988 451089
52356 4554882
71307 1871326
8317 6181154
14521 6475050
14816 9015609
163931 108169
66792 5137625
48903 1264375
8970 1893466
9390 15833723
36072 611591
26037 3416459
3867 19096955
184207 1448512
137450 3484027
47292 3374685
42815 2567980
32047 1725291
3545 13495563
36975 2164568
3014 17209688
67185 2886856
31994 621823
6206 4907599
63179 6320859
12467 1782224
20572 2271222
57331 670759
14872 965861
6471 1950075
50673 545202
22995 577370
1643 6877419
4489 2652203
2332 3870982
44826 1056545
1493 13486316
1381 21449564
410 92566749
136803 205067
16886 4476675
63122 2412493
122632 604831
21689 4014741
25495 746713
141328 1134870
149341 357102
6421 2556009
107677 2262058
90912 276553
27716 4562318
237457 533822
147366 1859652
155304 463065
119265 768336
64619 1609590
14568 2731305
74815 786690
93255 161085
24286 900375
30065 121241
360 43501483
76550 235431
43735 587553
41548 2199785
44935 127659
705 18734966
55201 3595617
64777 1911789
34739 2712310
7779 15734100
4199 4438044
12842 14413108
107054 238923
15480 4561536
84262 1396358
114907 4170191
5464 2317384
46200 4134292
44776 5481396
733 12088850
3302 28962954
4799 5587128
27357 13561841
12841 470832
42498 2908629
8464 1516570
107553 189188
96112 9948329
28909 7604756
71431 3247582
18896 5440374
40211 5219762
877 8349156
28168 4745740
66614 351696
6156 5691153
4368 28434737
50121 574665
82870 1601391
670 13640107
7651 2125475
11708 575985
3832 2509673
2023 3269878
6741 3207891
559 61020674
19603 1315119
88181 7996743
116218 541767
39050 3380074
13184 6340275
1101 13155627
19737 13290702
2316 36071278
64900 760132
139971 133729
31157 7773458
6901 5411446
4577 5090942
86677 585329
58810 2338615
35034 5964873
5840 4412034
147717 2689814
24784 5694390
24334 8642966
100515 1265119
38186 7510470
75938 1471422
161233 1761907
94402 1012898
59182 6529927
31012 2744981
22683 2984978
13819 9233255
19120 1372625
6836 17505904
31494 2205393
65925 3234172
91621 2431497
45203 3386660
35712 14148275
567 16958415
16077 12675462
25626 13934293
43741 802895
72726 571272
43312 6037241
47294 1097399
36448 4907617
34111 4482459
8276 12540320
14787 1696498
10411 986540
66768 5635620
3883 2351547
2995 4390873
84773 84375
7057 2199755
1251 7429846
45814 3667495
142197 1059824
6675 17183146
20658 6653394
23933 6088556
48906 5384191
32890 3778829
19730 7326150
27375 2334647
78608 3903449
126468 2871254
149809 4338807
10459 750004
1999 4436736
148987 433685
1130 5587768
87100 558035
117806 30840
52339 8632135
53393 589172
223100 9572
5923 619694
55833 346220
28150 280088
127754 299901
31639 637180
10644 2862131
39077 694603
8951 1641090
142635 187274
2454 204940739
8389 2829487
185712 231595
68562 44285
9173 1620052
671 11470363
5577 2080478
7976 2619538
76388 660148
163313 94766
429 14967159
201440 190704
197769 86408
17233 2044763
114437 297594
129114 4947346
60744 552865
117585 134165
9933 5718483
38689 1691356
12881 1672864
223716 23754
4623 5521024
38918 179508
101921 65533
65540 35067
27504 1086589
1361 22697009
141115 326439
96623 559323
33435 231841
1068 5572870
1716 5027419
14598 1705000
3277 5625184
141074 127949
19433 965238
2770 1113023
750 4936246
7925 2515071
91219 163177
153796 58118
44921 346374
109692 304962
6988 1301672
5224 21230754
136781 134123
3618 7122413
20580 964656
24377 863958
7954 3560560
84506 1688614
124180 679751
4112 2838946
3701 1728785
7634 1509003
6300 7267613
50026 649504
37631 242007
164531 141093
38350 3128758
52276 1209779
20052 277225
73461 540704
122976 34203
6858 1127254
11884 1492258
7436 1426146
10277 37254
20436 1278085
852 9963468
1590 1387980
132868 24030
1582 3491310
75053 1188678
30871 322596
166036 52073
7354 3621746
7536 5721665
24174 571988
20047 328911
5597 231361
3522 999327
45363 674107
115277 718297
100713 49403
58611 796609
66864 145191
5469 1328360
25242 571575
11068 793641
27684 1455161
8305 1870550
27128 411199
86057 470544
10103 2373434
1668 3334468
7881 287105
66224 907628
9613 12542964
196133 133378
3377 2484956
7174 2837411
1118 5847523
81896 1006121
105720 252202
159839 125166
28737 858401
41490 115713
186817 44456
86193 386852
16403 940811
18510 2304055
116711 914323
3842 1261955
15764 451263
13708 4928889
15041 779732
14313 1056394
102137 531795
1600 11182465
1941 6819329
6683 1284919
54071 4303680
181527 25977
807 44870293
168446 53035
14172 1068868
2699 3576690
69091 534424
557 29368179
118720 51685
13761 1156309
61061 611423
8243 978363
123951 842496
135429 210583
119943 1276276
3049 2648465
36836 523844
1519 3190082
232132 7294538
39262 522096
160429 24363
5148 3154654
25535 1185672
43205 269439
43120 514847
32359 359973
14519 926763
4300 6076684
165365 154797
806 19312031
1874 3040617
198854 276126
165588 16191
13256 516792
16696 771740
17895 1020857
959 16863129
34503 1985085
23415 2410801
124029 406809
104029 615617
72444 603241
300 54059995
4268 3195357
148146 40471
4473 1447800
49575 125835
157380 16893
92756 244856
607 2520409
206810 33214
6182 2034230
7825 2918551
107634 3172168
25878 1773173
43668 2148343
20913 3405704
9524 570666
4011 10655429
12865 3758025
145537 310032
49663 946111
75400 4123932
19163 451848
769 5172374
7256 9220416
111168 251252
14234 14517685
88913 745680
30532 2069501
23846 1026323
93454 151626
138903 126619
152452 1146849
9057 8032810
7869 11044304
108868 1867459
18737 702302
123810 222743
166501 345861
139191 158062
235330 57235
202985 47042
53660 386633
1450 2654227
86371 96597
193649 115471
134150 103512
112864 124746
10156 5345890
17764 702049
32655 2752168
20865 775651
147513 430103
54944 335116
148079 122471
41592 502663
2116 8074728
9389 2349450
56164 348435
27855 706062
157562 55688
66216 603420
172380 216436
4934 4297099
160967 193140
204519 115760
77133 131913
114980 148570
82346 50267
155063 659422
144262 112055
5559 3391547
50002 250609
16206 1510932
133783 181689
67131 55106
235555 288093
85180 255215
114246 135944
56250 1519618
117324 53445
54423 413935
221806 515
145189 278443
63612 463791
11098 3107124
139328 271862
114751 121504
82844 114893
142814 55701
119956 52254
24038 414632
147826 243090
75803 181942
106710 75192
133179 153106
22877 874675
109618 341358
61049 591479
178658 62284
52459 434315
123615 620086
201636 55764
110454 244414
15974 2427514
31239 935508
81337 384290
100685 190746
115318 2937905
15988 1603505
70131 22339
7953 6758040
122451 62154
74196 82100
2522 6454302
9473 1808835
392 4989722
136046 2821736
97876 3195599
15164 6491609
3737 6828982
57801 6312855
603 8115196
117591 3338590
7918 6685759
207045 1234508
19878 11707395
1027 13788762
90154 1226101
8822 3739754
76984 8286617
11665 7621967
573 5836688
7841 546642
69319 3243350
4567 14676538
154271 654406
146352 965145
52006 1343184
121673 3314243
22552 5352343
42187 8451073
2121 10452864
109125 829201
117015 1953996
110426 3874057
36930 4001590
30786 9208131
46228 435250
42521 2694571
51056 667042
59554 2104934
27199 9771822
136377 2466812
12757 2272737
91242 327965
63931 1111235
145908 485646
3042 3711173
24278 2493970
179542 90561
88352 625718
139460 532590
1199 4786566
14935 8941742
8890 662224
29940 883368
34153 1227027
54141 407815
42669 452043
110347 113253
19186 393966
109924 138018
79322 884314
96060 17285
407 13734329
136596 15510
21003 207393
16131 929585
175329 108472
107075 81566
809 5958050
63078 553694
71515 845380
171921 80824
188010 76506
6394 652118
110912 5580717
144852 130350
11716 4873025
173210 5968373
17756 16800883
15557 31499712
20121 12312705
42816 5789431
15053 8271728
143625 184401
47062 475251
8166 447856
26038 144887
73811 540827
36825 507685
103012 166094
152535 98963
1190 5577223
53978 255463
5624 11625588
42757 1744999
10058 1399817
13284 1346107
158646 118324
188617 87835
1183 4862439
61450 275041
6040 9585118
6175 1822233
28233 438526
33494 1331242
14248 726893
9699 1203569
130085 122406
138447 129382
11502 6048990
20107 637046
6308 2353797
169052 279737
42162 1348540
24208 661726
98882 240701
6208 885124
174215 80878
20982 11893634
24220 2576400
45731 2018158
2411 29783593
67506 6283832
1001 104011330
69795 2388132
54908 887395
6633 3129654
158212 579316
136076 502239
43160 1200546
29107 8828588
58500 812375
47993 1874400
692 14995398
149816 281473
13106 5047984
147812 480463
51555 1140412
97647 322430
68672 79879
150790 1622745
26471 8746437
45007 2213968
301 27198318
184286 1066209
11882 9453457
13797 15768519
41350 4520797
114703 1276057
66946 3125212
1652 18409916
126250 454739
108839 799770
39547 4619385
58058 1652553
21793 1139289
49135 2668921
2715 3482461
97403 345719
55424 3028951
2060 3504063
137560 820456
1619 2639725
97564 426294
86184 853896
49508 4284960
33788 1209595
143998 1030101
36849 8931664
81609 312611
2062 4127047
12313 992581
1042 151114674
189693 1196672
3705 6673181
34080 280233
103554 293779
193650 551073
60475 731935
20305 1066993
124821 192775
405 18738945
100501 1849776
1528 5424200
12312 10351320
150674 1229595
100926 2145562
21446 175874
53369 829165
98636 269366
8637 2978772
76645 1318240
188910 127939
31668 3124136
157379 149060
199405 104627
195459 131987
183584 132166
81694 369397
2295 3736275
13085 738907
197310 902666
37999 11828095
23064 2004493
5100 13337130
18447 15011577
87309 1221287
219691 274294
144628 783414
51573 392169
46363 342892
1861 15689767
67872 6771991
149101 1033007
26984 4336366
10570 744037
89066 319433
2325 24376564
54831 358454
3603 935815
28383 884287
107800 3242132
26102 811394
2634 1771927
192686 1781818
108360 2525261
12123 1873086
31086 551541
61331 380780
5193 18629266
12998 10218709
56303 237673
38290 801869
102694 1689843
2894 7387586
58023 4179636
6369 16026224
9963 3334009
94196 295822
229649 81389
58786 52193
84248 3194690
132299 79778
39760 806020
146471 2020825
110467 2912528
86280 969858
11817 3837356
12058 11750358
29516 3442423
2224 493281
15151 2171394
2567 4740308
4374 3684242
138807 4407810
116345 771704
227075 604803
904 174924670
3931 35879966
62425 111358
648 5553855
101475 157300
110521 142926
25239 733159
13699 3582284
81664 477248
20986 3160155
32439 2882350
2032 13606780
367 99705316
1792 14838463
24235 4273848
10991 18483750
6207 10756743
66469 2070191
59842 268171
1902 814076
75799 2663680
45553 1956014
111960 363599
2660 30983734
5790 2595741
21480 4041923
37075 2931860
124300 1838055
80734 467946
634 7570458
7709 3776113
19680 3427266
3155 6126896
134403 867170
9588 4354542
73547 694714
20581 5218346
41866 5837982
960 3195488
4248 17465617
34668 1505449
33154 763574
9848 3606130
67512 981453
1071 9055001
21610 1115659
17633 454186
163207 413755
43582 465030
56420 705690
101554 2428219
30313 1703823
10667 3166044
71740 272764
2713 3047700
21586 1927098
5968 624294
4023 2095400
36213 684546
8738 2481179
5413 6301973
9534 3350060
161255 188951
31280 998484
71865 549840
64954 864409
97970 1494651
42601 1158945
6722 1377888
11274 1512874
11863 1760961
64994 1650576
54277 613019
52675 591056
55308 1221210
57001 533343
17119 1324338
5736 5402727
80693 644676
94680 1174161
87359 1086356
27675 7256286
22112 2111427
98655 73392
2824 1524264
4801 6580705
28920 3913573
118712 1983927
8933 1252843
93258 478770
4721 2124864
30219 4561972
2739 9236712
29095 5361187
73235 1446732
790 160713087
44398 4616619
11989 11286685
233828 71285
